namespace Frontend.Components.Utils
{
    public static class PageUtils
    {
        public static Dictionary<int, string> PagesRusNames = new Dictionary<int, string>()
        {
            { 1, "Титульная страница" },
            { 2, "Контактные телефоны" },
            { 3, "Календарь праздников" },
            { 4, "Социальная характеристика учебной группы" },
            { 5, "График учебного процесса" },
            { 6, "Динамика основных показателей группы за период обучения" },
            { 7, "Актив учебной группы" },
            { 8, "Список студентов" },
            { 9, "Карта персонифицированного учета" },
            { 10, "Карта здоровья студентов" },
            { 11, "Учет итоговой успеваемости студентов группы" },
            { 12, "Учет идеологической и воспитательной работы куратора учебной группы (по месяцам)" },
            { 13, "Учет информационных часов" },
            { 14, "Участие куратора в работе педагогических семинаров" },
            { 15, "Работа с научно-методической и педагогической литературой" },
            { 16, "Психолого-педагогическая характеристика учебной группы" },
            { 17, "Рекомендации и замечания лиц, проверяющих работу куратора" },
            { 18, "Традиции вуза, факультета, группы" },
        };

        public static Dictionary<int, string> PageTypesRusNames = new Dictionary<int, string>()
        {
            { 1, "Титульные страницы" },
            { 2, "Контактные телефоны" },
            { 3, "Календарь праздников" },
            { 4, "Социальная характеристика учебной группы" },
            { 5, "График учебного процесса" },
            { 6, "Динамика основных показателей группы за период обучения" },
            { 7, "Актив учебной группы" },
            { 8, "Список студентов" },
            { 9, "Карты персонифицированного учета" },
            { 10, "Карты здоровья студентов" },
            { 11, "Учет итоговой успеваемости студентов группы" },
            { 12, "Учет идеологической и воспитательной работы куратора учебной группы (по месяцам)" },
            { 13, "Учет информационных часов" },
            { 14, "Участие куратора в работе педагогических семинаров" },
            { 15, "Работа с научно-методической и педагогической литературой" },
            { 16, "Психолого-педагогическая характеристика учебной группы" },
            { 17, "Рекомендации и замечания лиц, проверяющих работу куратора" },
            { 18, "Традиции вуза, факультета, группы" },
        };
    }
}
